In [1]:
#importing libraries
import pandas as pd
import mysql.connector
import numpy as np

In [2]:
%pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\user\anaconda3\lib\site-packages (9.0.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
# csv to dataframe
df_k=pd.read_csv("kerala_busdetails.csv")
df_wb=pd.read_csv("wbengal_busdetails.csv")
df_b=pd.read_csv("bihar_busdetails.csv")
df_r=pd.read_csv("rajas_busdetails.csv")
df_t=pd.read_csv("tele_busdetails.csv")
df_up=pd.read_csv("up_busdetails.csv")
df_p=pd.read_csv("punjab_busdetails.csv")
df_a=pd.read_csv("assam_busdetails.csv")
df_ap=pd.read_csv("andhra_busdetails.csv")
df_g=pd.read_csv("goa_busdetails.csv")
df_full1=pd.concat([df_a,df_up,df_ap,df_b,df_g,df_k,df_p,df_wb,df_t,df_r],ignore_index=True)
df_full1

,Bus_name,Bus_type,Start_time,End_time,Total_duration,Price,Seats_Available,Ratings,Route_link,Route_name
0,BLUE HILL TRAVELS INDIA LIMITED,NON A/C Seater Semi Sleeper (2+1),21:30,03:30,06h 00m,INR 400,5 Seats available,3.1\n100,https://www.redbus.in/bus-tickets/tezpur-to-gu...,Tezpur to Guwahati
1,Himalayan Travels,NON AC Seater / Sleeper 2+1,23:40,04:00,04h 20m,450,23 Seats available,2.2\n7,https://www.redbus.in/bus-tickets/tezpur-to-gu...,Tezpur to Guwahati
2,DESTINY TRAVELS,NON A/C Seater (2+1),23:45,03:45,04h 00m,399,22 Seats available,1.8,https://www.redbus.in/bus-tickets/tezpur-to-gu...,Tezpur to Guwahati
3,BLUE HILL TRAVELS INDIA LIMITED,NON A/C Seater Semi Sleeper (2+1),22:15,03:45,05h 30m,INR 550,15 Seats available,3.7\n28,https://www.redbus.in/bus-tickets/tezpur-to-gu...,Tezpur to Guwahati
4,Yatra Travels,NON A/C Seater (2+1),18:00,23:30,05h 30m,400,8 Seats available,3.3\n21,https://www.redbus.in/bus-tickets/guwahati-to-...,Guwahati to Tezpur
...,...,...,...,...,...,...,...,...,...,...
1200,RSRTC - 182762,Express Non AC Seater 2+3,21:55,02:45,04h 50m,INR 231,42 Seats available,4.2,https://www.redbus.in/bus-tickets/bikaner-to-s...,Bikaner to Sikar
1201,Neelam Travels,A/C Seater / Sleeper (2+1),18:30,23:00,04h 30m,INR 400,27 Seats available,3.5,https://www.redbus.in/bus-tickets/bikaner-to-s...,Bikaner to Sikar
1202,Milan Travels,Bharat Benz A/C Seater /Sleeper (2+1),19:15,22:30,03h 15m,440,31 Seats available,4.6\n11,https://www.redbus.in/bus-tickets/bikaner-to-s...,Bikaner to Sikar
1203,Nandu V.K. Travels,NON A/C Sleeper (2+1),19:30,23:45,04h 15m,INR 600,10 Seats available,3.2,https://www.redbus.in/bus-tickets/bikaner-to-s...,Bikaner to Sikar
1204,Maharaja Travels,NaN,22:30,02:45,04h 15m,NaN,NaN,3.1,https://www.redbus.in/bus-tickets/bikaner-to-s...,Bikaner to Sikar

Data cleaning

In [21]:
df_full1.columns

Index(['Bus_name', 'Bus_type', 'Start_time', 'End_time', 'Total_duration',
       'Price', 'Seats_Available', 'Ratings', 'Route_link', 'Route_name'],
      dtype='object')

In [22]:
# data about the data
df_full1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1205 entries, 0 to 1204
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         904 non-null    object
 1   Bus_type         876 non-null    object
 2   Start_time       904 non-null    object
 3   End_time         904 non-null    object
 4   Total_duration   904 non-null    object
 5   Price            897 non-null    object
 6   Seats_Available  892 non-null    object
 7   Ratings          902 non-null    object
 8   Route_link       1205 non-null   object
 9   Route_name       1205 non-null   object
dtypes: object(10)
memory usage: 94.3+ KB

In [5]:
# to display null values in columns
df_full1.isnull().sum()

Bus_name           301
Bus_type           329
Start_time         301
End_time           301
Total_duration     301
Price              308
Seats_Available    313
Ratings            303
Route_link           0
Route_name           0
dtype: int64

In [6]:
df_full1["Price"]

0       INR 400
1           450
2           399
3       INR 550
4           400
         ...
1200    INR 231
1201    INR 400
1202        440
1203    INR 600
1204        NaN
Name: Price, Length: 1205, dtype: object

In [7]:
#convert prices to numeric
# remove  INR 
# fill null values with 0
df_full1["Price"]=df_full1["Price"].str.replace("INR","")
df_full1["Price"]=df_full1["Price"].astype(float)
df_full1["Price"].fillna(0)

0       400.0
1       450.0
2       399.0
3       550.0
4       400.0
        ...
1200    231.0
1201    400.0
1202    440.0
1203    600.0
1204      0.0
Name: Price, Length: 1205, dtype: float64

In [8]:
df_full1["Ratings"]

0       3.1\n100
1         2.2\n7
2            1.8
3        3.7\n28
4        3.3\n21
          ...
1200         4.2
1201         3.5
1202     4.6\n11
1203         3.2
1204         3.1
Name: Ratings, Length: 1205, dtype: object

In [9]:
#convert Ratings to numeric
df_full1["Ratings"]=df_full1["Ratings"].str.replace("New","")
df_full1["Ratings"]=df_full1["Ratings"].str.strip()
df_full1["Ratings"]=df_full1["Ratings"].str.split().str[0]
df_full1["Ratings"] = pd.to_numeric(df_full1["Ratings"], errors='coerce') #  invalid parsing will be set as NaN 
df_full1["Ratings"].fillna(0,inplace=True) 
df_full1["Ratings"]

0       3.1
1       2.2
2       1.8
3       3.7
4       3.3
       ...
1200    4.2
1201    3.5
1202    4.6
1203    3.2
1204    3.1
Name: Ratings, Length: 1205, dtype: float64

In [12]:
# info after the data type change
df_full1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1205 entries, 0 to 1204
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         904 non-null    object
 1   Bus_type         876 non-null    object
 2   Start_time       904 non-null    object
 3   End_time         904 non-null    object
 4   Total_duration   904 non-null    object
 5   Price            897 non-null    float64
 6   Seats_Available  892 non-null    object
 7   Ratings          1205 non-null   float64
 8   Route_link       1205 non-null   object
 9   Route_name       1205 non-null   object
dtypes: float64(2), object(8)
memory usage: 94.3+ KB

In [20]:
df_full1.fillna(0,inplace=True)

In [21]:
df_full1.isnull().sum()

Bus_name           0
Bus_type           0
Start_time         0
End_time           0
Total_duration     0
Price              0
Seats_Available    0
Ratings            0
Route_link         0
Route_name         0
dtype: int64

In [22]:
# change dataframe to csv
path=r"D:/Redbus/complete_busdetails_clean.csv"
df_full1.to_csv(path,index=False)

# Create a mysql database

In [13]:
#sql connection
conn=mysql.connector.connect(host="localhost", user="root", password="root",database="redbus")
my_cursor = conn.cursor()
my_cursor.execute("CREATE DATABASE IF NOT EXISTS redbus")

In [17]:
# Table Creation
my_cursor.execute('''CREATE TABLE IF NOT EXISTS bus_details2(
                  ID INT AUTO_INCREMENT PRIMARY KEY,
                  Bus_name VARCHAR(255) NOT NULL,
                  Bus_type VARCHAR(255) NOT NULL,
                  Start_time VARCHAR(255) NOT NULL,
                  End_time VARCHAR(255) NOT NULL,
                  Total_duration VARCHAR(255) NOT NULL,
                  Price FLOAT NULL,
                  Seats_Available VARCHAR(255) NOT NULL,
                  Ratings Float NULL,
                  Route_link VARCHAR(255) NULL,
                  Route_name VARCHAR(255) NULL
                  )''')
print("MySQL Table Created in redbus Database successfully")

MySQL Table Created in redbus Database successfully